openfoam-cases/cylinder-zerofluid-dt0p001/Cylinder-zero-fluid-CrankNicolson/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (0 0.0 0);
boundaryField
{
    inlet
    {
        type       fixedValue;
        value      uniform (0 0 0);
    }

    outlet
    {
        type       zeroGradient;
    }

    cylinder
    {
        type       fixedValue;
        value      uniform (0 0 0);
    }

    top
    {
        type    slip;
    }

    bottom
    {
        type    slip;
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
